src/cf/Documents/ПланПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПланПереводов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПереводов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Произведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПланыПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыПереводов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПланПереводов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВыборкаРаспределения = РаспределенныйДневнойПлан();
	
	Движения.ПланыПереводов.Записывать = Истина;
	
	Пока ВыборкаРаспределения.Следующий() Цикл
		Движение = Движения.ПланыПереводов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаРаспределения);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РаспределенныйДневнойПлан()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикРаботы.Период КАК Период
		|ПОМЕСТИТЬ РабочиеДни
		|ИЗ
		|	РегистрСведений.ГрафикРаботы КАК ГрафикРаботы
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикРаботы.Период, МЕСЯЦ) = &Период
		|	И ГрафикРаботы.РабочийДень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланПереводовСотрудники.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	РабочиеДни.Период КАК ПериодПлана,
		|	ПланПереводовСотрудники.Пользователь КАК Пользователь,
		|	ПланПереводовСотрудники.Произведение КАК Произведение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВсегоДней.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ПланПереводовСотрудники.План / ВсегоДней.Количество
		|	КОНЕЦ КАК План
		|ИЗ
		|	Документ.ПланПереводов.Сотрудники КАК ПланПереводовСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеДни КАК РабочиеДни
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеДни.Период) КАК Количество
		|		ИЗ
		|			РабочиеДни КАК РабочиеДни) КАК ВсегоДней
		|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка
	
КонецФункции

#КонецОбласти
